In [1]:
d = {
'Name' : "Rukham",
"Semester" : 4,
"CGPA" : 3.47
}

In [2]:
d.keys()

dict_keys(['Name', 'Semester', 'CGPA'])

In [3]:
d.values()

dict_values(['Rukham', 4, 3.47])

In [4]:
d['Name'] = 'Absar'

In [5]:
d

{'Name': 'Absar', 'Semester': 4, 'CGPA': 3.47}

In [6]:
for i, j in d.items():
    print(f'{i}:{j}\n')

Name:Absar

Semester:4

CGPA:3.47

In [7]:
d.items()

dict_items([('Name', 'Absar'), ('Semester', 4), ('CGPA', 3.47)])

In [8]:
d = {
'Name' : ['Rukham', 'Absar', 'Shabbar', 'Hassan', 'Ahmed'],
"Semester" : [4,4,4,2,6],
"CGPA" : [3.4,3.8,2.9,3.2,3.1]
}

In [9]:
import pandas as pd

In [11]:
df = pd.DataFrame(d)

In [12]:
df

      Name  Semester  CGPA
0   Rukham         4   3.4
1    Absar         4   3.8
2  Shabbar         4   2.9
3   Hassan         2   3.2
4    Ahmed         6   3.1

In [13]:
df['high'] = df['CGPA']>=3.5

In [14]:
df

      Name  Semester  CGPA   high
0   Rukham         4   3.4  False
1    Absar         4   3.8   True
2  Shabbar         4   2.9  False
3   Hassan         2   3.2  False
4    Ahmed         6   3.1  False

In [20]:
df['Performance'] = df['CGPA']>=3.5 "High"

SyntaxError: invalid syntax (3870933060.py, line 1)

In [30]:
dfi = pd.DataFrame(d, index=d['Name'])

In [38]:
dfi.drop('Name', axis=1)

         Semester  CGPA Category
Rukham          4   3.4        B
Absar           4   3.8        A
Shabbar         4   2.9        C
Hassan          2   3.2        B
Ahmed           6   3.1        B

In [28]:
dfi = pd.DataFrame(d, index=range(5,10))

In [29]:
dfi

      Name  Semester  CGPA
5   Rukham         4   3.4
6    Absar         4   3.8
7  Shabbar         4   2.9
8   Hassan         2   3.2
9    Ahmed         6   3.1

In [32]:
dic = dict(dfi)

In [35]:
per = []
for i in d['CGPA']:
    if i>3.5:
        per.append("A")
    elif i>3:
        per.append("B")
    else:
        per.append('C')

In [36]:
dfi['Category'] = per

In [37]:
dfi

            Name  Semester  CGPA Category
Rukham    Rukham         4   3.4        B
Absar      Absar         4   3.8        A
Shabbar  Shabbar         4   2.9        C
Hassan    Hassan         2   3.2        B
Ahmed      Ahmed         6   3.1        B

In [39]:
dfi

            Name  Semester  CGPA Category
Rukham    Rukham         4   3.4        B
Absar      Absar         4   3.8        A
Shabbar  Shabbar         4   2.9        C
Hassan    Hassan         2   3.2        B
Ahmed      Ahmed         6   3.1        B

In [40]:
dfi.drop('Name', axis=1)

         Semester  CGPA Category
Rukham          4   3.4        B
Absar           4   3.8        A
Shabbar         4   2.9        C
Hassan          2   3.2        B
Ahmed           6   3.1        B